/**
  ******************************************************************************
  * @file    DS3231.C
  * @author  PineconePi(User)
  * @version V1.0.0
  * @date    17-June-2019
  * @brief  This document is used to drive DS3231.
  * @License:GNU General Public License v3.0         
  ******************************************************************************
  * @attention
  *	The frequency of crystal oscillator is 24 Mhz
  *
  *  
  * 
  * 
  * 
  * 
  *
  * 
  ******************************************************************************
	**/
#include "DS3231.h"
//========================================================================
// 函数: void DS3231_Wait()
// 描述: I2C应答。
// 参数: none.
// 返回: none.
// 版本: VER1.0.0
// 日期: 2019-06-17
// 备注: 
//========================================================================
void DS3231_Wait(){
	while(!(I2CMSST&0x40));
	I2CMSST&=~0x40;
}
//========================================================================
// 函数: void DS3231_Start()
// 描述: 发送START命令。
// 参数: none.
// 返回: none.
// 版本: VER1.0.0
// 日期: 2019-06-17
// 备注: 
//========================================================================
void DS3231_Start(){
	I2CMSCR=0x01;
	DS3231_Wait();
}
//========================================================================
// 函数: void DS3231_SendData(unsigned char dat)
// 描述: 写数据到数据缓冲区。
// 参数: none.
// 返回: none.
// 版本: VER1.0.0
// 日期: 2019-06-17
// 备注: 
//========================================================================
void DS3231_SendData(unsigned char dat){
	I2CTXD=dat;
	I2CMSCR=0x02;
	DS3231_Wait();
}
//========================================================================
// 函数: void DS3231_RecvACK()
// 描述: 发送读ACK命令。
// 参数: none.
// 返回: none.
// 版本: VER1.0.0
// 日期: 2019-06-17
// 备注: 
//========================================================================
void DS3231_RecvACK(){
	I2CMSCR=0x03;
	DS3231_Wait();
}
//========================================================================
// 函数: void DS3231_RecvACK()
// 描述: 发送RECV命令。
// 参数: none.
// 返回: none.
// 版本: VER1.0.0
// 日期: 2019-06-17
// 备注: 
//========================================================================
unsigned char DS3231_RecvData(){
	I2CMSCR=0x04;
	DS3231_Wait();
	return I2CRXD;
}
//========================================================================
// 函数: void DS3231_Stop()
// 描述: 发送STOP命令。
// 参数: none.
// 返回: none.
// 版本: VER1.0.0
// 日期: 2019-06-17
// 备注: 
//========================================================================
void DS3231_Stop(){
	I2CMSCR=0x06;
	DS3231_Wait();
}
//========================================================================
// 函数: unsigned char DS3231_read(unsigned char site)
// 描述: 向DS3231指定地址读取一个字节数据。
// 参数: Address,读取地址
// 返回: 一个字节数据.
// 版本: VER1.0.0
// 日期: 2019-06-17
// 备注: 
//========================================================================
unsigned char DS3231_Read(unsigned char Address){
	DS3231_Start();
	DS3231_SendData(0xD0);
	DS3231_RecvACK();
	DS3231_SendData(Address);
	DS3231_RecvACK();
	DS3231_Start();
	DS3231_SendData(0xD1);
	DS3231_RecvACK();
	DS3231_RecvData();
	DS3231_Stop();
	return I2CRXD;
}
//========================================================================
// 函数: void DS3231_Write(unsigned char Address,unsigned char dat)
// 描述: 向DS3231指定地址写入一个字节数据。
// 参数: Address,写入地址 Dat,数据
// 返回: none..
// 版本: VER1.0.0
// 日期: 2019-06-17
// 备注: 
//========================================================================
void DS3231_Write(unsigned char Address,unsigned char Dat){
	DS3231_Start();
	DS3231_SendData(0xD0);
	DS3231_RecvACK();
	DS3231_SendData(Address);
	DS3231_RecvACK();
	DS3231_SendData(Dat);
	DS3231_RecvACK();
	DS3231_Stop();
}