/**
  ******************************************************************************
  * @file    watchdog.c
  * @author  PineconePi
  * @version V1.0.0
  * @date    20-December-2018
  * @brief  This file is used to Configure internal WATCHDOG 
  * @License:GNU General Public License v3.0         
  ******************************************************************************
  * @attention
  *
  *
  *  
  * 
  * 
  * 
  * 
  *
  * 
  ******************************************************************************
	**/
#include "watchdog.h"

//========================================================================
// 函数: void setup_watchdog(unsigned char WDT_MODE_x)
// 描述: 设置并使能看门狗。
// 参数: WDT_MODE_x:对看门狗溢出时间进行设置
//       
//       
// 返回: 
// 版本: VER1.0.0
// 日期: 2018-12-20
// 作者: PineconePi
// 备注:
//	
//	
//	
//	
//	
//========================================================================
void setup_watchdog(unsigned char WDT_MODE_x)
{
    WDT_CONTR = WDT_MODE_x;            //使能并设置看门狗
}	
//========================================================================
// 函数: off_watchdog()
// 描述: 关闭看门狗。
// 参数: 
//       
//       
// 返回: 
// 版本: VER1.0.0
// 日期: 2018-12-20
// 作者: PineconePi
// 备注:
//	
//	
//	
//	
//	
//========================================================================
void off_watchdog()
{
	WDT_CONTR = 0x00; //关闭看门狗
}
//========================================================================
// 函数: void feed_dog()
// 描述: //喂看门狗,否则系统复位。
// 参数: 
//       
//       
// 返回: 
// 版本: VER1.0.0
// 日期: 2018-12-20
// 作者: PineconePi
// 备注:
//	
//	
//	
//	
//	
//========================================================================
void feed_dog()
{
	WDT_CONTR |= 0x10;                      //喂看门狗,否则系统复位
}